In [ ]:
#Pandas is a Python library that provides data structures and functions designed for data analysis and manipulation.

In [1]:
import pandas as pd

In [2]:
data_path="organizations-10000.csv"
df=pd.read_csv(data_path)
# print(df.head())
df.head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,522816eF8fdBE6d,Mckinney PLC,http://soto.com/,Sri Lanka,Synergized global system engine,1988,Dairy,3930
1,2,70C7FBD7e6Aa3Ea,Cunningham LLC,http://harding-duffy.com/,Namibia,Team-oriented fault-tolerant adapter,2018,Library,7871
2,3,428B397eA2d7290,Ruiz-Walls,http://www.atkins.biz/,Iran,Re-contextualized bifurcated moderator,2003,Hospital / Health Care,3095
3,4,9D234Ae8Cc51C1c,"Parrish, Osborne and Clarke",http://salazar.info/,British Indian Ocean Territory (Chagos Archipe...,Fully-configurable next generation concept,1989,Supermarkets,5422
4,5,6CDCcdE3D0b7b44,"Diaz, Robles and Haley",https://www.brooks-scott.net/,Botswana,Inverse intangible methodology,2013,Nanotechnology,3135

In [3]:
df.tail(2)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
9998,9999,01D2539e270CEbd,Wolfe-Mckee,http://www.parks.com/,Togo,Balanced value-added ability,1975,Environmental Services,2505
9999,10000,0D3b7DcFA21d92d,Beck LLC,https://wagner-glover.com/,Georgia,Decentralized context-sensitive service-desk,2007,Wireless,4552

In [6]:
df['Index'].max()

10000

In [8]:
df.min()

Index                                          1
Organization Id                  001d9DeBfFD6DD3
Name                                  Abbott Inc
Website                       http://abbott.net/
Country                              Afghanistan
Description            Adaptive 24/7 focus group
Founded                                     1970
Industry                              Accounting
Number of employees                            1
dtype: object

In [9]:
df.sample(4)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
9466,9467,C6EF7134bfa3B58,Cardenas Inc,http://hood.com/,Kyrgyz Republic,Customer-focused global frame,2014,Accounting,5623
3396,3397,9DB9BEb1a7cbcC2,Silva LLC,http://www.daugherty-norton.org/,Zimbabwe,Phased tertiary capability,2022,Aviation / Aerospace,1209
4180,4181,aDDCcefDD1F412e,Pennington Ltd,http://zuniga.info/,Bahamas,Multi-lateral optimizing emulation,1978,Public Relations / PR,9642
4087,4088,EfCa7f0Dae49aAb,Wilkerson Group,http://weaver-keith.com/,Samoa,Intuitive asymmetric firmware,1971,Outsourcing / Offshoring,1510

In [17]:
matches = df.index[df['Name'] == 'Cardenas']
print(matches)

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       9990, 9991, 9992, 9993, 9994, 9995, 9996, 9997, 9998, 9999],
      dtype='int64', length=10000)

In [20]:
df.loc[df['Index'] == '2', 'Name']

Series([], Name: Name, dtype: object)

In [21]:
df[df['Index'] == 2]['Name']

1    Cardenas
Name: Name, dtype: object

In [22]:
df.describe()

             Index       Founded  Number of employees
count  10000.00000  10000.000000         10000.000000
mean    5000.50000   1995.776700          4961.321000
std     2886.89568     14.991608          2911.862096
min        1.00000   1970.000000             1.000000
25%     2500.75000   1983.000000          2446.750000
50%     5000.50000   1996.000000          4894.000000
75%     7500.25000   2009.000000          7530.000000
max    10000.00000   2022.000000          9999.000000

In [23]:
df.columns

Index(['Index', 'Organization Id', 'Name', 'Website', 'Country', 'Description',
       'Founded', 'Industry', 'Number of employees'],
      dtype='object')

In [24]:
df['Number of employees']

0       3930
1       7871
2       3095
3       5422
4       3135
        ...
9995    6123
9996    9043
9997    8951
9998    2505
9999    4552
Name: Number of employees, Length: 10000, dtype: int64

In [27]:
df['Name']

0       Cardenas
1       Cardenas
2       Cardenas
3       Cardenas
4       Cardenas
          ...
9995    Cardenas
9996    Cardenas
9997    Cardenas
9998    Cardenas
9999    Cardenas
Name: Name, Length: 10000, dtype: object

In [28]:
df[['Name']]

          Name
0     Cardenas
1     Cardenas
2     Cardenas
3     Cardenas
4     Cardenas
...        ...
9995  Cardenas
9996  Cardenas
9997  Cardenas
9998  Cardenas
9999  Cardenas

[10000 rows x 1 columns]

In [33]:
df[df['Founded'] == 2018]['Country']

1                           Namibia
112                          Serbia
132                          Poland
153                     Afghanistan
193                            Togo
                   ...
9702            Antigua and Barbuda
9714                 American Samoa
9727                          Haiti
9941    French Southern Territories
9996                   Turkmenistan
Name: Country, Length: 195, dtype: object

In [36]:
df['Country'][df['Founded'] == 2018]

1                           Namibia
112                          Serbia
132                          Poland
153                     Afghanistan
193                            Togo
                   ...
9702            Antigua and Barbuda
9714                 American Samoa
9727                          Haiti
9941    French Southern Territories
9996                   Turkmenistan
Name: Country, Length: 195, dtype: object

In [37]:
new_df=df.drop_duplicates(['Country'])
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 243 entries, 0 to 1251
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Index                243 non-null    int64
 1   Organization Id      243 non-null    object
 2   Name                 243 non-null    object
 3   Website              243 non-null    object
 4   Country              243 non-null    object
 5   Description          243 non-null    object
 6   Founded              243 non-null    int64
 7   Industry             243 non-null    object
 8   Number of employees  243 non-null    int64
dtypes: int64(3), object(6)
memory usage: 19.0+ KB